app/controllers/bars_controller.rb

  def index
    @bars = Bar.order(sort_column+" "+sort_direction)

    attr = Bar.accessible_attributes

    attr.each do |atr|
---
SELECT "bars".* FROM "bars" WHERE (:addr_city=>'Bordeaux')
SELECT "bars".* FROM "bars" WHERE "bars"."atr" = 'Bordeaux'

  def show
    @bar = Bar.find(params[:id])
---
SELECT "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @bar = Bar.find(params[:id])
---
SELECT "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @bar = Bar.new(params[:bar])

    authorize! :create, @bar, :message => 'Not authorized.'

    respond_to do |format|
      if @bar.save
---
INSERT INTO "bars" ("addr_city", "addr_country", "addr_label", "addr_postal_code", "address", "created_at", "desc", "enable", "end_happy", "facebook", "happy", "latitude", "longitude", "name", "partner", "phone", "price", "price_happy", "site", "start_happy", "twitter", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "id"

  def update
    @bar = Bar.find(params[:id])

    authorize! :update, @bar, :message => 'Not authorized.'

    respond_to do |format|
      if @bar.update_attributes(params[:bar])
---
SELECT "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "bars" SET "address" = 'Marseille', "happy" = 'f', "enable" = 'f', "partner" = 'f', "phone" = '', "facebook" = '', "twitter" = '', "site" = '', "latitude" = 43.296482, "longitude" = 5.36978, "addr_label" = '17 Rue de la Loge', "addr_city" = 'Marseille', "addr_postal_code" = '13002', "addr_country" = 'FR', "updated_at" = '2014-05-20 21:59:18.993375' WHERE "bars"."id" = 6

  def destroy
    @bar = Bar.find(params[:id])
    authorize! :destroy, @bar, :message => 'Not authorized.'

    @bar.destroy
---
SELECT "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "bars" WHERE "bars"."id" = $1  [["id", 1]]