app/controllers/home_controller.rb

SELECT "bars".* FROM "bars"
SELECT "users".* FROM "users"
---
  def index
    @bars = Bar.all
    respond_to do |format|
      format.html # index.html.erb
      format.json { render json: @bars }
    end
    @users = User.all